Coding/Cpp/STLAlgorithm.org
#+OPTIONS: ^:{} _:{} num:t toc:t \n:t
#+include "../../template-toc.org"
#+title: STL: Algorithm

* copy
#+begin_src c++
template< class InputIterator, class OutputIterator >
OutputIterator copy( InputIterator first, InputIterator last, OutputIterator d_first );
#+end_src
  所做的操作类似为 *d_first = *first, *(d_first+1)=*(first+1) ...
* copy_backward
#+begin_src c++
template< class BidirectionalIterator1, class BidirectionalIterator2 >
BidirectionalIterator2 copy_backward( BidirectionalIterator1 first,
                                      BidirectionalIterator1 last,
                                      BidirectionalIterator2 d_last );
#+end_src
  所做的操作类似为 *d_last=*last, *(d_last-1)=*(last-1),...
  与copy的区别在于指定目的区域的末地址，而copy指定的是首地址。且拷贝顺序不同。
  此函数适用于拷贝区间与目的区间存在交叉，且从前拷贝到后的情况，例如：1-10区间拷贝到5-15，如果用copy函数则 *有可能* 会毁坏数据.
  同理如果从5-15拷贝到1-10如果用copy_backward则 *有可能* 毁坏数据。

  *为什么是有可能?*
  因为两个copy根据其操作对象的不同采用不同的行为，如果是原始指针则采用 *memmove* 方法而此函数由于借助了其它辅助空间所以不会产生覆盖。
#+begin_src c++
     int ary[] = {0,1,2,3,4,5,6};
     copy(ary, ary+3, ary+1);
     for_each(ary, ary+sizeof(ary)/sizeof(int), display<int>()); // 0 0 1 2 4 5 6
#+end_src
  表面上看应该会产生覆盖所以结果应该是 0 0 0 0 4 5 6，但其实结果是 0 0 1 2 4 5 6，原因就是因为原始指针调用的是 memmove.
  由于vector内部typedef value_type* iterator;所以其迭代器也是原始指针，所以也调用的是memmove,不必担心覆盖的问题。
#+begin_src c++
     int ary[] = {0,1,2,3,4,5,6};
     vector<int> ivec(ary, ary+sizeof(ary)/sizeof(int));
     copy(ivec.begin(), ivec.begin()+3, ivec.begin()+1);
     for_each(ivec.begin(), ivec.end(), display<int>()); // 0 0 1 2 4 5 6
#+end_src
  list由于其迭代器非原始指针，故最终调用的是循环复制，所以会造成覆盖。
#+begin_src c++
     list<int> List(ary, ary+sizeof(ary)/sizeof(int));
     typedef list<int>::iterator listiter;
     listiter first=List.begin();
     advance(first,2);
     listiter last=List.end();
     advance(last, -2);
     listiter result=List.begin();
     advance(result,4);
     copy(first, last, result);
     for_each(List.begin(), List.end(), display<int>());        //0 1 2 3 2 3 2 3 2
#+end_src
* copy_n (C++11)
#+begin_src c++
template< class InputIterator, class Size, class OutputIterator>
OutputIterator copy_n(InputIterator first, Size count, OutputIterator result);
#+end_src
* accumulate
#+begin_src c++
template< class InputIterator, class T >
T accumulate( InputIterator first, InputIterator last, T init );
template< class InputIterator, class T, class BinaryOperation >
T accumulate( InputIterator first, InputIterator last, T init,
              BinaryOperation op );
#+end_src
  1. 返回对[first,last)之间的元素和init求和结果。
  2. 与1的区别在于使用op函数而非求和函数。
#+begin_src c++
     int ary[] = {0,1,2,3,4,5,6,7,8};
     // 0+0+1+2...
     cout<<accumulate(ary, ary+sizeof(ary)/sizeof(int), 0)<<endl; // 36
     // 0-0-1-2-3-...
     cout<<accumulate(ary, ary+sizeof(ary)/sizeof(int), 0, minus<int>())<<endl; // -36
#+end_src
