Coding/Cpp/STLAlgorithm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>STL: Algorithm</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="STL: Algorithm"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-14 09:03:27 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#cpp">主页</a></div>


</head>
<body>


<div id="content">
<h1 class="title">STL: Algorithm</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/too_many_toc.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>



<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 copy</a></li>
<li><a href="#sec-2">2 copy_backward</a></li>
<li><a href="#sec-3">3 copy_n (C++11)</a></li>
<li><a href="#sec-4">4 accumulate</a></li>
<li><a href="#sec-5">5 inner_product</a></li>
<li><a href="#sec-6">6 partial_sum</a></li>
<li><a href="#sec-7">7 adjacent_difference</a></li>
<li><a href="#sec-8">8 equal</a></li>
<li><a href="#sec-9">9 fill</a></li>
<li><a href="#sec-10">10 fill_n</a></li>
<li><a href="#sec-11">11 iter_swap</a></li>
<li><a href="#sec-12">12 swap</a></li>
<li><a href="#sec-13">13 swap_range</a></li>
<li><a href="#sec-14">14 lexicographical_compare</a></li>
<li><a href="#sec-15">15 mismatch</a></li>
<li><a href="#sec-16">16 set_union</a></li>
<li><a href="#sec-17">17 set_difference</a></li>
<li><a href="#sec-18">18 set_intersection</a></li>
<li><a href="#sec-19">19 set_symmetric_difference</a></li>
<li><a href="#sec-20">20 adjacent_find</a></li>
<li><a href="#sec-21">21 count, count_if</a></li>
<li><a href="#sec-22">22 find, find_if, find_if_not(C++11)</a></li>
<li><a href="#sec-23">23 find_end</a></li>
<li><a href="#sec-24">24 find_first_of</a></li>
<li><a href="#sec-25">25 for_each</a></li>
<li><a href="#sec-26">26 transform</a></li>
<li><a href="#sec-27">27 generate, generate_n</a></li>
<li><a href="#sec-28">28 includes</a></li>
<li><a href="#sec-29">29 max_element, min_element</a></li>
<li><a href="#sec-30">30 merge, inplace_merge</a></li>
<li><a href="#sec-31">31 partition, stable_partition</a></li>
<li><a href="#sec-32">32 remove, remove_if, remove_copy, remove_copy_if</a></li>
<li><a href="#sec-33">33 replace, replace_if, replace_copy, replace_copy_if</a></li>
<li><a href="#sec-34">34 reverse, reverse_copy</a></li>
<li><a href="#sec-35">35 rotate, rotate_copy</a></li>
<li><a href="#sec-36">36 search</a></li>
<li><a href="#sec-37">37 search_n</a></li>
<li><a href="#sec-38">38 unique, unique_copy</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> copy</h2>
<div class="outline-text-2" id="text-1">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">copy</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span> );
</pre>

<p>
  所做的操作类似为 *d_first = *first, *(d_first+1)=*(first+1) &hellip;<br/>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> copy_backward</h2>
<div class="outline-text-2" id="text-2">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BidirectionalIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BidirectionalIterator2</span> &gt;
<span style="color: #228b22;">BidirectionalIterator2</span> <span style="color: #0000ff;">copy_backward</span>( <span style="color: #228b22;">BidirectionalIterator1</span> <span style="color: #a0522d;">first</span>,
                                      <span style="color: #228b22;">BidirectionalIterator1</span> <span style="color: #a0522d;">last</span>,
                                      <span style="color: #228b22;">BidirectionalIterator2</span> <span style="color: #a0522d;">d_last</span> );
</pre>

<p>
  所做的操作类似为 *d_last=*last, *(d_last-1)=*(last-1),&hellip;<br/>
  与copy的区别在于指定目的区域的末地址，而copy指定的是首地址。且拷贝顺序不同。<br/>
  此函数适用于拷贝区间与目的区间存在交叉，且从前拷贝到后的情况，例如：1-10区间拷贝到5-15，如果用copy函数则 <b>有可能</b> 会毁坏数据.<br/>
  同理如果从5-15拷贝到1-10如果用copy_backward则 <b>有可能</b> 毁坏数据。<br/>
</p>
<p>
  <b>为什么是有可能?</b><br/>
  因为两个copy根据其操作对象的不同采用不同的行为，如果是原始指针则采用 <b>memmove</b> 方法而此函数由于借助了其它辅助空间所以不会产生覆盖。<br/>
</p>


<pre class="src src-c++"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">ary</span>[] = {0,1,2,3,4,5,6};
copy(ary, ary+3, ary+1);
for_each(ary, ary+<span style="color: #a020f0;">sizeof</span>(ary)/<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">int</span>), <span style="color: #228b22;">display</span>&lt;<span style="color: #228b22;">int</span>&gt;()); <span style="color: #b22222;">// </span><span style="color: #b22222;">0 0 1 2 4 5 6</span>
</pre>

<p>
  表面上看应该会产生覆盖所以结果应该是 0 0 0 0 4 5 6，但其实结果是 0 0 1 2 4 5 6，原因就是因为原始指针调用的是 memmove.<br/>
  由于vector内部typedef value_type* iterator;所以其迭代器也是原始指针，所以也调用的是memmove,不必担心覆盖的问题。<br/>
</p>


<pre class="src src-c++"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">ary</span>[] = {0,1,2,3,4,5,6};
<span style="color: #228b22;">vector</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #0000ff;">ivec</span>(ary, ary+<span style="color: #a020f0;">sizeof</span>(ary)/<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">int</span>));
copy(ivec.begin(), ivec.begin()+3, ivec.begin()+1);
for_each(ivec.begin(), ivec.end(), <span style="color: #228b22;">display</span>&lt;<span style="color: #228b22;">int</span>&gt;()); <span style="color: #b22222;">// </span><span style="color: #b22222;">0 0 1 2 4 5 6</span>
</pre>

<p>
  list由于其迭代器非原始指针，故最终调用的是循环复制，所以会造成覆盖。<br/>
</p>


<pre class="src src-c++"><span style="color: #228b22;">list</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #0000ff;">List</span>(ary, ary+<span style="color: #a020f0;">sizeof</span>(ary)/<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">int</span>));
<span style="color: #a020f0;">typedef</span> <span style="color: #008b8b;">list</span>&lt;<span style="color: #228b22;">int</span>&gt;::<span style="color: #228b22;">iterator</span> <span style="color: #228b22;">listiter</span>;
<span style="color: #228b22;">listiter</span> <span style="color: #a0522d;">first</span>=List.begin();
advance(first,2);
<span style="color: #228b22;">listiter</span> <span style="color: #a0522d;">last</span>=List.end();
advance(last, -2);
<span style="color: #228b22;">listiter</span> <span style="color: #a0522d;">result</span>=List.begin();
advance(result,4);
copy(first, last, result);
for_each(List.begin(), List.end(), <span style="color: #228b22;">display</span>&lt;<span style="color: #228b22;">int</span>&gt;());        <span style="color: #b22222;">//</span><span style="color: #b22222;">0 1 2 3 2 3 2 3 2</span>
</pre>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> copy_n (C++11)</h2>
<div class="outline-text-2" id="text-3">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Size</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>&gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">copy_n</span>(<span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">Size</span> <span style="color: #a0522d;">count</span>, <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">result</span>);
</pre>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> accumulate</h2>
<div class="outline-text-2" id="text-4">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">T</span> <span style="color: #0000ff;">accumulate</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">init</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryOperation</span> &gt;
<span style="color: #228b22;">T</span> <span style="color: #0000ff;">accumulate</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">init</span>,
              <span style="color: #228b22;">BinaryOperation</span> <span style="color: #a0522d;">op</span> );
</pre>

<ol>
<li>返回对[first,last)之间的元素和init求和结果。<br/>
</li>
<li>与1的区别在于使用op函数而非求和函数。<br/>
</li>
</ol>




<pre class="src src-c++"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">ary</span>[] = {0,1,2,3,4,5,6,7,8};
<span style="color: #b22222;">// </span><span style="color: #b22222;">0+0+1+2...</span>
cout&lt;&lt;accumulate(ary, ary+<span style="color: #a020f0;">sizeof</span>(ary)/<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">int</span>), 0)&lt;&lt;endl; <span style="color: #b22222;">// </span><span style="color: #b22222;">36</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">0-0-1-2-3-...</span>
cout&lt;&lt;accumulate(ary, ary+<span style="color: #a020f0;">sizeof</span>(ary)/<span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">int</span>), 0, <span style="color: #228b22;">minus</span>&lt;<span style="color: #228b22;">int</span>&gt;())&lt;&lt;endl; <span style="color: #b22222;">// </span><span style="color: #b22222;">-36</span>
</pre>

</div>

</div>
