Coding/Cpp/STLAlgorithm.org
* inner_product
#+begin_src c++
template< class InputIterator1, class InputIterator2, class T >
T inner_product( InputIterator1 first1, InputIterator1 last1,
                 InputIterator2 first2, T value );

template<
    class InputIterator1,
    class InputIterator2,
    class T,
    class BinaryOperation1,
    class BinaryOperation2
> T inner_product( InputIterator1 first1, InputIterator1 last1,
                   InputIterator2 first2, T value,
                   BinaryOperation1 op1,
                   BinaryOperation2 op2 );
#+end_src
  1. [first1, last1)与first2开始last1-first1个构成的区间对应的元素相乘后相加。
  2. 1中的相乘改为op2，相加改为op1.
#+begin_src c++
     int ip1[] = {1,2,3};
     int ip2[] = {2,3,4,5,6};
     cout<<inner_product(ip1,ip1+3,ip2, 100)<<endl; // 100+1*2+2*3+3*4=120
     cout<<inner_product(ip1,ip1+3,ip2, 100, minus<int>(), plus<int>())<<endl; // 100-(1+2)-(2+3)-(3+4)=85
#+end_src
* partial_sum
#+begin_src c++
template< class InputIterator, class OutputIterator >
OutputIterator partial_sum( InputIterator first, InputIterator last, OutputIterator d_first );

template< class InputIterator, class OutputIterator, class BinaryOperation >
OutputIterator partial_sum( InputIterator first, InputIterator last, OutputIterator d_first,
                            BinaryOperation op );
#+end_src
  所做的操作为：
#+begin_example
*(d_first)   = *first;
*(d_first+1) = *first + *(first+1);
*(d_first+2) = *first + *(first+1) + *(first+2);
*(d_first+3) = *first + *(first+1) + *(first+2) + *(first+3);
...
#+end_example
  第2个版本中用op操作替换+.
#+begin_src c++
     int ip2[] = {2,3,4,5,6};
     partial_sum(ip2, ip2+5, ostream_iterator<int>(cout, " ")); // 2 5 9 14 20
     partial_sum(ip2, ip2+5, ostream_iterator<int>(cout, " "), minus<int>()); // 2 -1 -5 -10 -16
#+end_src
* adjacent_difference
  与partial_sum相似。只是操作相邻元素。
#+begin_example
*(d_first)   = *first;
*(d_first+1) = (*first+1) - *(first);
*(d_first+2) = (*first+2) - *(first+1);
*(d_first+3) = (*first+3) - *(first+2);
#+end_example

#+begin_src c++
     int ip2[] = {2,3,4,5,6};
     adjacent_difference(ip2, ip2+5, ostream_iterator<int>(cout, " ")); // 2 1 1 1 1
     adjacent_difference(ip2, ip2+5, ostream_iterator<int>(cout, " "), plus<int>()); // 2 5 7 9 11
#+end_src
* equal
#+begin_src c++
template< class InputIterator1, class InputIterator2 >
bool equal( InputIterator1 first1, InputIterator1 last1, 
            InputIterator2 first2 );

template< class InputIterator1, class InputIterator2, class BinaryPredicate >
bool equal( InputIterator1 first1, InputIterator1 last1, 
            InputIterator2 first2, BinaryPredicate p );
#+end_src
  [first1,last1)之间的元素是否与first2开始的同等个数的区间对应元素相同。如果first2开始的元素个数没有first1到last1之间的多则结果不确定。
  第2个版本可以自定义比较操作，默认是相等。
#+begin_src c++
     int ip1[] = {1,2,3};
     int ip2[] = {1,2,3,4,5,6};
     cout<<equal(ip1,ip1+3,ip2)<<endl; // 1
     cout<<equal(ip1,ip1+3,ip2+1)<<endl; // 0
     cout<<equal(ip1,ip1+3,ip2+1, less<int>())<<endl; // 1
#+end_src
* fill
#+begin_src c++
template< class ForwardIterator, class T >
void fill( ForwardIterator first, ForwardIterator last, const T& value );
#+end_src
  用value填充区间[first,last).
* fill_n
#+begin_src c++
template< class OutputIterator, class Size, class T >
void fill_n( OutputIterator first, Size count, const T& value );        //before c++11

template< class OutputIterator, class Size, class T >
OutputIterator fill_n( OutputIterator first, Size count, const T& value ); //C++11
#+end_src
  填充指定位置开始的指定个数元素，C++11中返回值与advance(first,count);相同。
