Coding/Cpp/STLAlgorithm.html

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> iter_swap</h2>
<div class="outline-text-2" id="text-11">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator2</span> &gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">iter_swap</span>( <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">b</span> );
</pre>

<p>
  交换两个迭代器的内容。调用的是swap函数。<br/>
</p></div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> swap</h2>
<div class="outline-text-2" id="text-12">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">swap</span>( <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">b</span> );

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">N</span> &gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">swap</span>( <span style="color: #228b22;">T</span> (&amp;<span style="color: #a0522d;">a</span>)[N], <span style="color: #228b22;">T</span> (&amp;<span style="color: #a0522d;">b</span>)[N]);       <span style="color: #b22222;">//</span><span style="color: #b22222;">c++11</span>
</pre>

<p>
  swap可交换的对象包含了几乎所有的泛型对象：vector,list,queue&hellip;<br/>
  C++11的swap调用的是swap_range(a, a+N, b);<br/>
</p></div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> swap_range</h2>
<div class="outline-text-2" id="text-13">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator2</span> &gt;
<span style="color: #228b22;">ForwardIterator2</span> <span style="color: #0000ff;">swap_ranges</span>( <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">last1</span>, <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">first2</span> )
</pre>

<p>
  交换[first1,last1)与first2开始的区间。<br/>
  内部调用的是iter_swap。<br/>
</p></div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> lexicographical_compare</h2>
<div class="outline-text-2" id="text-14">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span> &gt;
<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">lexicographical_compare</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
                              <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>, <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">last2</span> );

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Compare</span> &gt;
<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">lexicographical_compare</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
                              <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>, <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">last2</span>,
                              <span style="color: #228b22;">Compare</span> <span style="color: #a0522d;">comp</span> );
</pre>

<p>
  以词典序排序。<br/>
  先比较 min((last1-first1),(last2-first2)) 个，如果比较出来则返回否则第1个区间短则返回真否则返回假。<br/>
</p></div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> mismatch</h2>
<div class="outline-text-2" id="text-15">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span> &gt;
<span style="color: #008b8b;">std</span>::<span style="color: #228b22;">pair</span>&lt;<span style="color: #228b22;">InputIterator1</span>,<span style="color: #228b22;">InputIterator2</span>&gt;
    <span style="color: #0000ff;">mismatch</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>,
              <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
              <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span> );

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryPredicate</span> &gt;
<span style="color: #008b8b;">std</span>::<span style="color: #228b22;">pair</span>&lt;<span style="color: #228b22;">InputIterator1</span>,<span style="color: #228b22;">InputIterator2</span>&gt;
    <span style="color: #0000ff;">mismatch</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>,
              <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
              <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>,
              <span style="color: #228b22;">BinaryPredicate</span> <span style="color: #a0522d;">p</span> );
</pre>

<p>
  返回第一次不匹配的第1个区间迭代器和第2个区间迭代器构成的pair.<br/>
</p></div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> set_union</h2>
<div class="outline-text-2" id="text-16">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">set_union</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
                          <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>, <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">last2</span>,
                          <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span>,
          <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Compare</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">set_union</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
                          <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>, <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">last2</span>,
                          <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span>, <span style="color: #228b22;">Compare</span> <span style="color: #a0522d;">comp</span> );
</pre>

<p>
  欲合并的两个集合必须是已经排序好的，故 set, multiset可以但 unordered_set, unordered_multiset不可用。<br/>
  第1版本默认是less排序。<br/>
  若某元素a在S1 [first1,last)中出现n次，在S2 [first2,last2)中出现 m次，则结果中出现 <code>max(n,m)</code> 次，其中S1中的全部出现在结果中，S2中出现 <code>max(n-m,0)</code> 次。<br/>
  结果是稳定的，即相对次序不变。<br/>
</p></div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> set_difference</h2>
<div class="outline-text-2" id="text-17">

<p>  结果中a出现次数为 <code>max(n-m,0)</code> ，全部来自S1<br/>
</p></div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> set_intersection</h2>
<div class="outline-text-2" id="text-18">

<p>  结果中a出现次数为 <code>min(n,m)</code> ，全部来自S1<br/>
</p></div>

</div>

<div id="outline-container-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> set_symmetric_difference</h2>
<div class="outline-text-2" id="text-19">

<p>  结果中a出现次数为 <code>|n-m|</code> ，若 n&gt;m则S1中的最后n-m个a为结果的a，若n&lt;m则S2中最后的m-n个a为结果中的a。<br/>
</p></div>

</div>

<div id="outline-container-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> adjacent_find</h2>
<div class="outline-text-2" id="text-20">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span> &gt;
<span style="color: #228b22;">ForwardIterator</span> <span style="color: #0000ff;">adjacent_find</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #228b22;">BinaryPredicate</span> <span style="color: #a0522d;">p</span> &gt;
<span style="color: #228b22;">ForwardIterator</span> <span style="color: #0000ff;">adjacent_find</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">BinaryPredicate</span> <span style="color: #a0522d;">p</span> );
</pre>

<p>
  返回连续相同元素的第1个元素的迭代器。第2个版本定义了“相同“含义。<br/>
</p></div>

</div>
