Coding/Cpp/STLAlgorithm.org
* count, count_if
#+begin_src c++
template< class InputIterator, class T >
typename iterator_traits<InputIterator>::difference_type
    count( InputIterator first, InputIterator last, const T &value );

template< class InputIterator, class UnaryPredicate >
typename iterator_traits<InputIterator>::difference_type
    count_if( InputIterator first, InputIterator last, UnaryPredicate p );
#+end_src
  统计指定元素在某区间出现个数，第2个版本定义了“相同“含义。
* find, find_if, find_if_not(C++11)
#+begin_src c++
template< class InputIterator, class T >
InputIterator find( InputIterator first, InputIterator last, const T& value );
template< class InputIterator, class UnaryPredicate >
InputIterator find_if( InputIterator first, InputIterator last, UnaryPredicate p );
template< class InputIterator, class UnaryPredicate >
InputIterator find_if_not( InputIterator first, InputIterator last, UnaryPredicate q );
#+end_src
  查找某元素在某区间的第1次出现的位置，如果没有查找到则返回last.
  if定义了“相同“含义。
  if_not 查找第1个相同的元素。
* find_end
#+begin_src c++
template< class ForwardIterator1, class ForwardIterator2 >
ForwardIterator1 find_end( ForwardIterator1 first, ForwardIterator1 last,
                           ForwardIterator2 s_first, ForwardIterator2 s_last );
template< class ForwardIterator1, class ForwardIterator2, class BinaryPredicate >
ForwardIterator1 find_end( ForwardIterator1 first, ForwardIterator1 last,
                           ForwardIterator2 s_first, ForwardIterator2 s_last, BinaryPredicate p );
#+end_src
  查找 [s_first, s_last)作为[first, last)的子序列最后出现的位置，如果不是子序列则返回 last
#<<find_first_of>>
* find_first_of
#+begin_src c++
template< class ForwardIterator1, class ForwardIterator2 >
ForwardIterator1 find_first_of( ForwardIterator1 first, ForwardIterator1 last,
                                ForwardIterator2 s_first, ForwardIterator2 s_last );

template< class ForwardIterator1, class ForwardIterator2, class BinaryPredicate >
ForwardIterator1 find_first_of( ForwardIterator1 first, ForwardIterator1 last,
                                ForwardIterator2 s_first, ForwardIterator2 s_last, BinaryPredicate p );
#+end_src
  [s_first, s_last)中任意一个元素第1次在[first,last)中出现的位置，如果任何元素都没有在[first,last)中出现则返回last.
* for_each
#+begin_src c++
template< class InputIterator, class UnaryFunction >
UnaryFunction for_each( InputIterator first, InputIterator last, UnaryFunction f );
#+end_src
  对[first,last)中每个元素都施加函数f，可以通过解引用来修改相应的元素（此时最好用transform函数）。
* transform
#+begin_src c++
template< class InputIterator, class OutputIterator, class UnaryOperation >
OutputIterator transform( InputIterator first1, 
                          InputIterator last1,
                          OutputIterator d_first, 
                          UnaryOperation unary_op );
template< class InputIterator1, class InputIterator2, class OutputIterator, class BinaryOperation >
OutputIterator transform( InputIterator1 first1, 
                          InputIterator1 last1,
                          InputIterator2 first2, 
                          OutputIterator d_first, 
                          BinaryOperation binary_op );
#+end_src
  1. 对[first1,last1)中每个元素作用一元函数f，结果保存在d_first开始的组件中（d_first开始的组件大小必须>=last1-first1).
  2. 以[first1,last1)中每个元素和以first2开头的相应元素做为二元函数f的参数，结果保存在d_first中。
