Coding/Cpp/STLAlgorithm.html

<div id="outline-container-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> count, count_if</h2>
<div class="outline-text-2" id="text-21">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #a020f0;">typename</span> <span style="color: #008b8b;">iterator_traits</span>&lt;<span style="color: #228b22;">InputIterator</span>&gt;::<span style="color: #228b22;">difference_type</span>
    <span style="color: #0000ff;">count</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span> &amp;<span style="color: #a0522d;">value</span> );

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">UnaryPredicate</span> &gt;
<span style="color: #a020f0;">typename</span> <span style="color: #008b8b;">iterator_traits</span>&lt;<span style="color: #228b22;">InputIterator</span>&gt;::<span style="color: #228b22;">difference_type</span>
    <span style="color: #0000ff;">count_if</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">UnaryPredicate</span> <span style="color: #a0522d;">p</span> );
</pre>

<p>
  统计指定元素在某区间出现个数，第2个版本定义了“相同“含义。<br/>
</p></div>

</div>

<div id="outline-container-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> find, find_if, find_if_not(C++11)</h2>
<div class="outline-text-2" id="text-22">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">InputIterator</span> <span style="color: #0000ff;">find</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">value</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">UnaryPredicate</span> &gt;
<span style="color: #228b22;">InputIterator</span> <span style="color: #0000ff;">find_if</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">UnaryPredicate</span> <span style="color: #a0522d;">p</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">UnaryPredicate</span> &gt;
<span style="color: #228b22;">InputIterator</span> <span style="color: #0000ff;">find_if_not</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">UnaryPredicate</span> <span style="color: #a0522d;">q</span> );
</pre>

<p>
  查找某元素在某区间的第1次出现的位置，如果没有查找到则返回last.<br/>
  if定义了“相同“含义。<br/>
  if_not 查找第1个相同的元素。<br/>
</p></div>

</div>

<div id="outline-container-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> find_end</h2>
<div class="outline-text-2" id="text-23">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator2</span> &gt;
<span style="color: #228b22;">ForwardIterator1</span> <span style="color: #0000ff;">find_end</span>( <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">last</span>,
                           <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">s_first</span>, <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">s_last</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator2</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryPredicate</span> &gt;
<span style="color: #228b22;">ForwardIterator1</span> <span style="color: #0000ff;">find_end</span>( <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">last</span>,
                           <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">s_first</span>, <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">s_last</span>, <span style="color: #228b22;">BinaryPredicate</span> <span style="color: #a0522d;">p</span> );
</pre>

<p>
  查找 [s_first, s_last)作为[first, last)的子序列最后出现的位置，如果不是子序列则返回 last<br/>
</p></div>

</div>

<div id="outline-container-24" class="outline-2">
<h2 id="sec-24"><a name="find_first_of" id="find_first_of"></a><span class="section-number-2">24</span> find_first_of</h2>
<div class="outline-text-2" id="text-24">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator2</span> &gt;
<span style="color: #228b22;">ForwardIterator1</span> <span style="color: #0000ff;">find_first_of</span>( <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">last</span>,
                                <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">s_first</span>, <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">s_last</span> );

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator2</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryPredicate</span> &gt;
<span style="color: #228b22;">ForwardIterator1</span> <span style="color: #0000ff;">find_first_of</span>( <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">last</span>,
                                <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">s_first</span>, <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">s_last</span>, <span style="color: #228b22;">BinaryPredicate</span> <span style="color: #a0522d;">p</span> );
</pre>

<p>
  [s_first, s_last)中任意一个元素第1次在[first,last)中出现的位置，如果任何元素都没有在[first,last)中出现则返回last.<br/>
</p></div>

</div>

<div id="outline-container-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> for_each</h2>
<div class="outline-text-2" id="text-25">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">UnaryFunction</span> &gt;
<span style="color: #228b22;">UnaryFunction</span> <span style="color: #0000ff;">for_each</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">UnaryFunction</span> <span style="color: #a0522d;">f</span> );
</pre>

<p>
  对[first,last)中每个元素都施加函数f，可以通过解引用来修改相应的元素（此时最好用transform函数）。<br/>
</p></div>

</div>

<div id="outline-container-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> transform</h2>
<div class="outline-text-2" id="text-26">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">UnaryOperation</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">transform</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first1</span>, 
                          <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last1</span>,
                          <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span>, 
                          <span style="color: #228b22;">UnaryOperation</span> <span style="color: #a0522d;">unary_op</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryOperation</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">transform</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, 
                          <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
                          <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>, 
                          <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span>, 
                          <span style="color: #228b22;">BinaryOperation</span> <span style="color: #a0522d;">binary_op</span> );
</pre>

<ol>
<li>对[first1,last1)中每个元素作用一元函数f，结果保存在d_first开始的组件中（d_first开始的组件大小必须&gt;=last1-first1).<br/>
</li>
<li>以[first1,last1)中每个元素和以first2开头的相应元素做为二元函数f的参数，结果保存在d_first中。<br/>
</li>
</ol>

</div>

</div>
