Coding/Cpp/STLAlgorithm.org
* generate, generate_n
#+begin_src c++
template< class ForwardIterator, class Generator >
void generate( ForwardIterator first, ForwardIterator last, Generator g );

template< class OutputIterator, class Size, class Generator >
void generate_n( OutputIterator first, Size count, Generator g );
#+end_src     
  用生成器g返回值依次替换[first,last)中每个元素/替换以first开始的count个元素。
#+begin_src c++
class incf_by_one
{
private:
     static int __count;
public:
     int operator()(){return __count++;}
};
int incf_by_one::__count = 0;

int main(int argc, char *argv[])
{
     vector<int> ivec(10);
     generate(ivec.begin(), ivec.end(), incf_by_one());
     for_each(ivec.begin(), ivec.end(), display<int>()); // 0 1 2 3 4 5 6 7 8 9
     return 0;
}

#+end_src
* includes
#+begin_src c++
template< class InputIterator1, class InputIterator2 >
bool includes( InputIterator1 first1, InputIterator1 last1,
               InputIterator2 first2, InputIterator2 last2 );
template< class InputIterator1, class InputIterator2 >
bool includes( InputIterator1 first1, InputIterator1 last1,
               InputIterator2 first2, InputIterator2 last2, Compare comp );
#+end_src
  *已排序* 的集合[first2,last2)是否是 *已排序* 的集合[first1,last1)的子集。（不一定是连续出现的）
#+begin_src c++
     int tp1[] = {1,2,3,4};
     int tp2[] = {1,3};
     cout<<includes(tp1,tp1+4,tp2,tp2+2)<<endl; // 1
#+end_src
* max_element, min_element
#+begin_src c++
template< class ForwardIterator > 
ForwardIterator max_element( ForwardIterator first, ForwardIterator last );
template< class ForwardIterator, class Compare >
ForwardIterator max_element( ForwardIterator first, ForwardIterator last, 
                             Compare comp );
#+end_src
  返回一个区间中最大/最小元素。
* merge, inplace_merge
#+begin_src c++
template< class InputIterator1, class InputIterator2, class OutputIterator >
OutputIterator merge( InputIterator1 first1, InputIterator1 last1,
                      InputIterator2 first2, InputIterator2 last2 
                      OutputIterator d_first );
template< class InputIterator1, class InputIterator2, class OutputIterator, class Compare>
OutputIterator merge( InputIterator1 first1, InputIterator1 last1,
                      InputIterator2 first2, InputIterator2 last2 
                      OutputIterator d_first, Compare comp );
#+end_src
  *已排序* 的两个区间合并后保存到d_first开始的区间内。默认是less，可以自定义比较函数comp.
#+begin_src c++
template< class BidirectionalIterator >
void inplace_merge( BidirectionalIterator first,
                    BidirectionalIterator middle,
                    BidirectionalIterator last );
template< class BidirectionalIterator, class Compare>
void inplace_merge( BidirectionalIterator first,
                    BidirectionalIterator middle,
                    BidirectionalIterator last,
                    Compare comp );
#+end_src
  两个 *已排序* 的连续区间合并为一个区间。
* partition, stable_partition
#+begin_src c++
template< class BidirectionalIterator, class UnaryPredicate >
BidirectionalIterator partition( BidirectionalIterator first, BidirectionalIterator last,
                                 UnaryPredicate p );
template< class BidirectionalIterator, class UnaryPredicate >
BidirectionalIterator stable_partition( BidirectionalIterator first, BidirectionalIterator last,
                                        UnaryPredicate p );
#+end_src
  将区间内符合条件p的元素放在区间开始位置，不符合的放到后面。
  前者是不稳定（即不保证次序不变），后者是稳定的，即次序保持不变。
