Coding/Cpp/STLAlgorithm.html

<div id="outline-container-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> generate, generate_n</h2>
<div class="outline-text-2" id="text-27">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Generator</span> &gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">generate</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">Generator</span> <span style="color: #a0522d;">g</span> );

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Size</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Generator</span> &gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">generate_n</span>( <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">Size</span> <span style="color: #a0522d;">count</span>, <span style="color: #228b22;">Generator</span> <span style="color: #a0522d;">g</span> );
</pre>

<p>
  用生成器g返回值依次替换[first,last)中每个元素/替换以first开始的count个元素。<br/>
</p>


<pre class="src src-c++"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">incf_by_one</span>
{
<span style="color: #a020f0;">private</span>:
     <span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">__count</span>;
<span style="color: #a020f0;">public</span>:
     <span style="color: #228b22;">int</span> <span style="color: #a020f0;">operator</span><span style="color: #0000ff;">()</span>(){<span style="color: #a020f0;">return</span> __count++;}
};
<span style="color: #228b22;">int</span> <span style="color: #008b8b;">incf_by_one</span>::<span style="color: #a0522d;">__count</span> = 0;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">argv</span>[])
{
     <span style="color: #228b22;">vector</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">ivec</span>(10);
     generate(ivec.begin(), ivec.end(), incf_by_one());
     for_each(ivec.begin(), ivec.end(), <span style="color: #228b22;">display</span>&lt;<span style="color: #228b22;">int</span>&gt;()); <span style="color: #b22222;">// </span><span style="color: #b22222;">0 1 2 3 4 5 6 7 8 9</span>
     <span style="color: #a020f0;">return</span> 0;
}

</pre>

</div>

</div>

<div id="outline-container-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> includes</h2>
<div class="outline-text-2" id="text-28">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span> &gt;
<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">includes</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
               <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>, <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">last2</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span> &gt;
<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">includes</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
               <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>, <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">last2</span>, <span style="color: #228b22;">Compare</span> <span style="color: #a0522d;">comp</span> );
</pre>

<p>
  <b>已排序</b> 的集合[first2,last2)是否是 <b>已排序</b> 的集合[first1,last1)的子集。（不一定是连续出现的）<br/>
</p>


<pre class="src src-c++"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">tp1</span>[] = {1,2,3,4};
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">tp2</span>[] = {1,3};
cout&lt;&lt;includes(tp1,tp1+4,tp2,tp2+2)&lt;&lt;endl; <span style="color: #b22222;">// </span><span style="color: #b22222;">1</span>
</pre>

</div>

</div>

<div id="outline-container-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> max_element, min_element</h2>
<div class="outline-text-2" id="text-29">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span> &gt; 
<span style="color: #228b22;">ForwardIterator</span> <span style="color: #0000ff;">max_element</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Compare</span> &gt;
<span style="color: #228b22;">ForwardIterator</span> <span style="color: #0000ff;">max_element</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, 
                             <span style="color: #228b22;">Compare</span> <span style="color: #a0522d;">comp</span> );
</pre>

<p>
  返回一个区间中最大/最小元素。<br/>
</p></div>

</div>

<div id="outline-container-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> merge, inplace_merge</h2>
<div class="outline-text-2" id="text-30">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">merge</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
                      <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>, <span style="color: #228b22;">InputIterator2</span> last2 
                      <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator2</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Compare</span>&gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">merge</span>( <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">first1</span>, <span style="color: #228b22;">InputIterator1</span> <span style="color: #a0522d;">last1</span>,
                      <span style="color: #228b22;">InputIterator2</span> <span style="color: #a0522d;">first2</span>, <span style="color: #228b22;">InputIterator2</span> last2 
                      <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span>, <span style="color: #228b22;">Compare</span> <span style="color: #a0522d;">comp</span> );
</pre>

<p>
  <b>已排序</b> 的两个区间合并后保存到d_first开始的区间内。默认是less，可以自定义比较函数comp.<br/>
</p>


<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BidirectionalIterator</span> &gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">inplace_merge</span>( <span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #a0522d;">first</span>,
                    <span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #a0522d;">middle</span>,
                    <span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #a0522d;">last</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BidirectionalIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Compare</span>&gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">inplace_merge</span>( <span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #a0522d;">first</span>,
                    <span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #a0522d;">middle</span>,
                    <span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #a0522d;">last</span>,
                    <span style="color: #228b22;">Compare</span> <span style="color: #a0522d;">comp</span> );
</pre>

<p>
  两个 <b>已排序</b> 的连续区间合并为一个区间。<br/>
</p></div>

</div>

<div id="outline-container-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> partition, stable_partition</h2>
<div class="outline-text-2" id="text-31">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BidirectionalIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">UnaryPredicate</span> &gt;
<span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #0000ff;">partition</span>( <span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #a0522d;">last</span>,
                                 <span style="color: #228b22;">UnaryPredicate</span> <span style="color: #a0522d;">p</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BidirectionalIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">UnaryPredicate</span> &gt;
<span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #0000ff;">stable_partition</span>( <span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #a0522d;">last</span>,
                                        <span style="color: #228b22;">UnaryPredicate</span> <span style="color: #a0522d;">p</span> );
</pre>

<p>
  将区间内符合条件p的元素放在区间开始位置，不符合的放到后面。<br/>
  前者是不稳定（即不保证次序不变），后者是稳定的，即次序保持不变。<br/>
</p></div>

</div>
