Coding/Cpp/STLAlgorithm.org
* remove, remove_if, remove_copy, remove_copy_if
#+begin_src c++
template< class ForwardIterator, class T >
ForwardIterator remove( ForwardIterator first, ForwardIterator last, 
                        const T& value );
template< class ForwardIterator, class UnaryPredicate >
ForwardIterator remove_if( ForwardIterator first, ForwardIterator last, 
                           UnaryPredicate p );

template< class InputIterator, class OutputIterator, class T >
OutputIterator remove_copy( InputIterator first,
                            InputIterator last,
                            OutputIterator d_first,
                            const T& value );
template< class InputIterator, class OutputIterator, class UnaryPredicate >
OutputIterator remove_copy_if( InputIterator first,
                               InputIterator last,
                               OutputIterator d_first,
                               UnaryPredicate p );
#+end_src
  前两个删除区间中符合条件的/指定的元素，删除时靠移动元素，故新尾端和旧尾端之间的元素不变。
  后两个是将区间删除后的结果拷贝到指定位置。
#+begin_src c++
     int tp1[] = {1,2,3,4};
     vector<int> ivec(tp1, tp1+4);
     remove(ivec.begin(), ivec.end(), 3);
     for_each(ivec.begin(), ivec.end(), display<int>()); // 1 2 4 4
#+end_src  
* replace, replace_if, replace_copy, replace_copy_if
#+begin_src c++
template< class ForwardIterator, class T >
void replace( ForwardIterator first, ForwardIterator last, const T& old_value, const T& new_value );

template< class ForwardIterator, class UnaryPredicate, class T >
void replace_if( ForwardIterator first, ForwardIterator last, UnaryPredicate p, const T& new_value );

template< class InputIterator, class OutputIterator, class T >
OutputIterator replace_copy( InputIterator first, InputIterator last, OutputIterator d_first, const T& old_value, const T& new_value );

template< class InputIterator, class OutputIterator, class UnaryPredicate, class T >
OutputIterator replace_copy_if( InputIterator first, InputIterator last, OutputIterator d_first, UnaryPredicate p, const T& new_value );
#+end_src
  将区间中所有指定元素/符合条件的元素替换成指定元素。
  前两个原地修改。
  后两个将作用结果保存到指定位置。
* reverse, reverse_copy
#+begin_src c++
template< class BidirectionalIterator >
void reverse( BidirectionalIterator first, BidirectionalIterator last );
#+end_src
  逆转指定区间。
* rotate, rotate_copy
#+begin_src c++
template< class ForwardIterator >
void rotate( ForwardIterator first, ForwardIterator middle, ForwardIterator last );
template< class ForwardIterator, class OutputIterator >
OutputIterator rotate_copy( ForwardIterator first, ForwardIterator middle, ForwardIterator last, OutputIterator d_first );
#+end_src
  将[first,middle)与[middle,last)两个区间交换位置。
* search
#+begin_src c++
template< class ForwardIterator1, class ForwardIterator2 >
ForwardIterator1 search( ForwardIterator1 first, ForwardIterator1 last, ForwardIterator2 s_first, ForwardIterator2 s_last );
template< class ForwardIterator1, class ForwardIterator2, class BinaryPredicate >
ForwardIterator1 search( ForwardIterator1 first, ForwardIterator1 last, ForwardIterator2 s_first, ForwardIterator2 s_last, BinaryPredicate p );
#+end_src
  [s_first, s_last)区间第1次在[first,last)中出现的位置，如果区间没有在[first,last)中出现则返回last.
  与 [[find_first_of]] 的区别在：后者只需要满足任意一个元素出现即可，而前者必须所有元素完全匹配。
