Coding/Cpp/STLAlgorithm.html

<div id="outline-container-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> remove, remove_if, remove_copy, remove_copy_if</h2>
<div class="outline-text-2" id="text-32">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">ForwardIterator</span> <span style="color: #0000ff;">remove</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, 
                        <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">value</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">UnaryPredicate</span> &gt;
<span style="color: #228b22;">ForwardIterator</span> <span style="color: #0000ff;">remove_if</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, 
                           <span style="color: #228b22;">UnaryPredicate</span> <span style="color: #a0522d;">p</span> );

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">remove_copy</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>,
                            <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>,
                            <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span>,
                            <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">value</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">UnaryPredicate</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">remove_copy_if</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>,
                               <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>,
                               <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span>,
                               <span style="color: #228b22;">UnaryPredicate</span> <span style="color: #a0522d;">p</span> );
</pre>

<p>
  前两个删除区间中符合条件的/指定的元素，删除时靠移动元素，故新尾端和旧尾端之间的元素不变。<br/>
  后两个是将区间删除后的结果拷贝到指定位置。<br/>
</p>


<pre class="src src-c++"><span style="color: #228b22;">int</span> <span style="color: #a0522d;">tp1</span>[] = {1,2,3,4};
<span style="color: #228b22;">vector</span>&lt;<span style="color: #228b22;">int</span>&gt; <span style="color: #0000ff;">ivec</span>(tp1, tp1+4);
remove(ivec.begin(), ivec.end(), 3);
for_each(ivec.begin(), ivec.end(), <span style="color: #228b22;">display</span>&lt;<span style="color: #228b22;">int</span>&gt;()); <span style="color: #b22222;">// </span><span style="color: #b22222;">1 2 4 4</span>
</pre>

</div>

</div>

<div id="outline-container-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> replace, replace_if, replace_copy, replace_copy_if</h2>
<div class="outline-text-2" id="text-33">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">replace</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">old_value</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">new_value</span> );

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">UnaryPredicate</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">replace_if</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">UnaryPredicate</span> <span style="color: #a0522d;">p</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">new_value</span> );

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">replace_copy</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">old_value</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">new_value</span> );

<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">InputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">UnaryPredicate</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">replace_copy_if</span>( <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">InputIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span>, <span style="color: #228b22;">UnaryPredicate</span> <span style="color: #a0522d;">p</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">new_value</span> );
</pre>

<p>
  将区间中所有指定元素/符合条件的元素替换成指定元素。<br/>
  前两个原地修改。<br/>
  后两个将作用结果保存到指定位置。<br/>
</p></div>

</div>

<div id="outline-container-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> reverse, reverse_copy</h2>
<div class="outline-text-2" id="text-34">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BidirectionalIterator</span> &gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">reverse</span>( <span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">BidirectionalIterator</span> <span style="color: #a0522d;">last</span> );
</pre>

<p>
  逆转指定区间。<br/>
</p></div>

</div>

<div id="outline-container-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> rotate, rotate_copy</h2>
<div class="outline-text-2" id="text-35">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span> &gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">rotate</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">middle</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span> &gt;
<span style="color: #228b22;">OutputIterator</span> <span style="color: #0000ff;">rotate_copy</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">middle</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span> );
</pre>

<p>
  将[first,middle)与[middle,last)两个区间交换位置。<br/>
</p></div>

</div>

<div id="outline-container-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> search</h2>
<div class="outline-text-2" id="text-36">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator2</span> &gt;
<span style="color: #228b22;">ForwardIterator1</span> <span style="color: #0000ff;">search</span>( <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">s_first</span>, <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">s_last</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator1</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator2</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryPredicate</span> &gt;
<span style="color: #228b22;">ForwardIterator1</span> <span style="color: #0000ff;">search</span>( <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator1</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">s_first</span>, <span style="color: #228b22;">ForwardIterator2</span> <span style="color: #a0522d;">s_last</span>, <span style="color: #228b22;">BinaryPredicate</span> <span style="color: #a0522d;">p</span> );
</pre>

<p>
  [s_first, s_last)区间第1次在[first,last)中出现的位置，如果区间没有在[first,last)中出现则返回last.<br/>
  与 <a href="#sec-24">find_first_of</a> 的区别在：后者只需要满足任意一个元素出现即可，而前者必须所有元素完全匹配。<br/>
</p></div>

</div>
