Coding/Cpp/STLAlgorithm.org
* search_n
#+begin_src c++
template< class ForwardIterator, class Size, class T >
ForwardIterator1 search_n( ForwardIterator first, ForwardIterator last, Size count, const T& value );
template< class ForwardIterator, class Size, class T, class BinaryPredicate >
ForwardIterator1 search_n( ForwardIterator first, ForwardIterator last, Size count, const T& value, BinaryPredicate p );
#+end_src
  连续count个value在[first,last)中出现的位置。
* unique, unique_copy
#+begin_src c++
template< class ForwardIterator >
ForwardIterator unique( ForwardIterator first, ForwardIterator last );
template< class ForwardIterator, class BinaryPredicate >
ForwardIterator unique( ForwardIterator first, ForwardIterator last, BinaryPredicate p );
template< class ForwardIterator, class OutputIterator >
ForwardIterator unique_copy( ForwardIterator first, ForwardIterator last, OutputIterator d_first );
template< class ForwardIterator, class OutputIterator, class BinaryPredicate >
ForwardIterator unique_copy( ForwardIterator first, ForwardIterator last, OutputIterator d_first, BinaryPredicate p );
#+end_src
  删除 *连续* 的重复元素。
