Coding/Cpp/STLAlgorithm.html

<div id="outline-container-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> search_n</h2>
<div class="outline-text-2" id="text-37">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Size</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span> &gt;
<span style="color: #228b22;">ForwardIterator1</span> <span style="color: #0000ff;">search_n</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">Size</span> <span style="color: #a0522d;">count</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">value</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Size</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryPredicate</span> &gt;
<span style="color: #228b22;">ForwardIterator1</span> <span style="color: #0000ff;">search_n</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">Size</span> <span style="color: #a0522d;">count</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">value</span>, <span style="color: #228b22;">BinaryPredicate</span> <span style="color: #a0522d;">p</span> );
</pre>

<p>
  连续count个value在[first,last)中出现的位置。<br/>
</p></div>

</div>

<div id="outline-container-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> unique, unique_copy</h2>
<div class="outline-text-2" id="text-38">




<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span> &gt;
<span style="color: #228b22;">ForwardIterator</span> <span style="color: #0000ff;">unique</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryPredicate</span> &gt;
<span style="color: #228b22;">ForwardIterator</span> <span style="color: #0000ff;">unique</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">BinaryPredicate</span> <span style="color: #a0522d;">p</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span> &gt;
<span style="color: #228b22;">ForwardIterator</span> <span style="color: #0000ff;">unique_copy</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span> );
<span style="color: #a020f0;">template</span>&lt; <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ForwardIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">OutputIterator</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">BinaryPredicate</span> &gt;
<span style="color: #228b22;">ForwardIterator</span> <span style="color: #0000ff;">unique_copy</span>( <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">first</span>, <span style="color: #228b22;">ForwardIterator</span> <span style="color: #a0522d;">last</span>, <span style="color: #228b22;">OutputIterator</span> <span style="color: #a0522d;">d_first</span>, <span style="color: #228b22;">BinaryPredicate</span> <span style="color: #a0522d;">p</span> );
</pre>

<p>
  删除 <b>连续</b> 的重复元素。<br/>
</p></div>
</div>
</div>

</body>
</html>
